Repository: Yeasin84/appointmrnt-booking-app
Catalog: lib/l10n/app_*.arb
Languages: ar, bn

# appTitle
source: AroggyaPath
ar: دوك موبي
bn: আরোগ্য পথ

source: Welcome
ar: أهلاً بك
bn: স্বাগতম

source: Settings
ar: الإعدادات
bn: সেটিংস

source: Change Language
ar: تغيير اللغة
bn: ভাষা পরিবর্তন করুন

source: English
ar: الإنجليزية
bn: ইংরেজি

source: Arabic
ar: العربية

source: Select Language
ar: اختر اللغة
bn: ভাষা নির্বাচন করুন

source: French
ar: الفرنسية

# navHome
source: Home
ar: الرئيسية
bn: হোম

# navAppointments
source: Appointments
ar: المواعيد
bn: অ্যাপয়েন্টমেন্ট

# navReels
source: Reels
ar: الريلز
bn: রিলস

# navMessages
source: Messages
ar: الرسائل
bn: মেসেজ

# navProfile
source: Profile
ar: الملف الشخصي
bn: প্রোফাইল

source: Personal Info
ar: المعلومات الشخصية
bn: ব্যক্তিগত তথ্য

source: My Appointment
ar: موعدي
bn: আমার অ্যাপয়েন্টমেন্ট

source: My Dependents
ar: المعالين
bn: আমার নির্ভরশীলরা

source: Appointment Setting
ar: إعدادات المواعيد
bn: অ্যাপয়েন্টমেন্ট সেটিংস

source: My Earning
ar: أرباحي
bn: আমার আয়

# changePasswordLabel
source: Change Password
ar: تغيير كلمة المرور
bn: পাসওয়ার্ড পরিবর্তন

source: Help & Support
ar: المساعدة والدعم
bn: সাহায্য ও সহযোগিতা

source: Log Out
ar: تسجيل الخروج
bn: লগ আউট

source: Loading...
ar: جارٍ التحميل...
bn: লোড হচ্ছে...

# checkingAuth
source: Checking authentication
ar: التحقق من المصادقة
bn: প্রমাণীকরণ যাচাই করা হচ্ছে

source: Invalid Session
ar: جلسة غير صالحة
bn: অবৈধ সেশন

# sessionExpiredMessage
source: Your session is invalid. Please login again.
ar: جلستك غير صالحة. يرجى تسجيل الدخول مرة أخرى.
bn: আপনার সেশনটি অবৈধ। অনুগ্রহ করে আবার লগইন করুন।

source: Go to Login
ar: الذهاب إلى تسجيل الدخول
bn: লগইন এ যান

# searchDoctorHint
source: Search Doctor...
ar: البحث عن طبيب...
bn: ডাক্তার খুঁজুন...

# locationServicesDisabledTitle
source: Location Services Disabled
ar: خدمات الموقع معطلة
bn: লোকেশন সার্ভিস নিষ্ক্রিয়

# locationServicesDisabledMessage
source: Location services are disabled. Please enable them to see nearby doctors.
ar: خدمات الموقع معطلة. يرجى تمكينها لرؤية الأطباء القريبين.
bn: লোকেশন সার্ভিস নিষ্ক্রিয় রয়েছে। কাছের ডাক্তারদের দেখতে এটি সক্রিয় করুন।

# locationPermissionRequiredTitle
source: Location Permission Required
ar: مطلوب إذن الموقع
bn: লোকেশন পারমিশন প্রয়োজন

# locationPermissionRequiredMessage
source: Location permission is required to show nearby doctors. Please grant permission in app settings.
ar: مطلوب إذن الموقع لإظهار الأطباء القريبين. يرجى منح الإذن في إعدادات التطبيق.
bn: কাছের ডাক্তারদের দেখাতে লোকেশন পারমিশন প্রয়োজন। অনুগ্রহ করে সেটিংস থেকে পারমিশন দিন।

source: Open Settings
ar: افتح الإعدادات
bn: সেটিংস খুলুন

source: Cancel
ar: إلغاء
bn: বাতিল

source: Loading route...
ar: جارٍ تحميل المسار...
bn: রাস্তা লোড হচ্ছে...

# directionsApiDisabled
source: Directions API not enabled. Using straight line route.
ar: لم يتم تفعيل واجهة برمجة تطبيقات الاتجاهات. استخدام مسار الخط المستقيم.

source: Retry
ar: إعادة المحاولة
bn: আবার চেষ্টা করুন

source: Loading map...
ar: جارٍ تحميل الخريطة...
bn: ম্যাপ লোড হচ্ছে...

source: Distance
ar: المسافة
bn: দূরত্ব

source: Upcoming Appointment
ar: المواعيد القادمة
bn: পরবর্তী অ্যাপয়েন্টমেন্ট

source: Nearby Doctors
ar: أطباء قريبون
bn: কাছের ডাক্তাররা

source: See All
ar: مشاهدة الكل
bn: সব দেখুন

source: No doctors found
ar: لم يتم العثور على أطباء
bn: কোন ডাক্তার পাওয়া যায়নি

source: Available
ar: متاح
bn: উপলব্ধ

source: No Schedule
ar: لا يوجد جدول
bn: কোন শিডিউল নেই

source: Video Consultation
ar: استشارة فيديو
bn: ভিডিও পরামর্শ

source: Book Now
ar: احجز الآن
bn: এখনই বুক করুন

source: Not Available
ar: غير متاح
bn: উপলব্ধ নেই

source: No schedule set
ar: لم يتم تعيين جدول زمني
bn: কোন শিডিউল সেট করা নেই

# searchFailed
source: Search failed: {error}
ar: فشل البحث: {error}
bn: অনুসন্ধান ব্যর্থ হয়েছে: {error}

# sessionExpiredTitle
source: Session Expired
ar: انتهت الجلسة
bn: সেশন শেষ হয়েছে

# sessionExpiredMessageDoc
source: Your session has expired. Please login again.
ar: انتهت صلاحية جلستك. يرجى تسجيل الدخول مرة أخرى.
bn: আপনার সেশন শেষ হয়ে গেছে। অনুগ্রহ করে আবার লগইন করুন।

source: OK
ar: حسناً
bn: ঠিক আছে

# failedLoadPosts
source: Failed to load posts
ar: فشل تحميل المنشورات
bn: পোস্ট লোড করতে ব্যর্থ

# connectionError
source: Connection error. Please try again.
ar: خطأ في الاتصال. يرجى المحاولة مرة أخرى.
bn: লিঙ্ক ত্রুটি। অনুগ্রহ করে আবার চেষ্টা করুন।

# searchHintDoctor
source: Search doctors, posts, specialties...
ar: ابحث عن أطباء، منشورات، تخصصات...
bn: ডাক্তার, পোস্ট, বিশেষত্ব খুঁজুন...

source: Suggestions
ar: اقتراحات
bn: পরামর্শ

source: Searching...
ar: جارٍ البحث...
bn: অনুসন্ধান করা হচ্ছে...

# searchAnything
source: Search for anything
ar: ابحث عن أي شيء
bn: যেকোন কিছু খুঁজুন

# findEverything
source: Find doctors, posts, or specialties
ar: ابحث عن أطباء، منشورات، أو تخصصات
bn: ডাক্তার, পোস্ট বা বিশেষত্ব খুঁজুন

source: No results found
ar: لم يتم العثور على نتائج
bn: কোন ফলাফল পাওয়া যায়নি

# tryDifferentKeywords
source: Try searching with different keywords
ar: حاول البحث بكلمات رئيسية مختلفة
bn: অন্যান্য কি-ওয়ার্ড দিয়ে চেষ্টা করুন

source: Posts
ar: المنشورات
bn: পোস্ট

# noPostsYet
source: No posts yet. Be the first to share!
ar: لا توجد منشورات بعد. كن أول من يشارك!
bn: এখনো কোন পোস্ট নেই। প্রথমটি আপনিই শেয়ার করুন!

# shareInsights
source: Share your insights with fellow doctors...
ar: شارك أفكارك مع زملائك الأطباء...
bn: অন্যান্য ডাক্তারদের সাথে আপনার মতামত শেয়ার করুন...

source: Photo
ar: صور
bn: ছবি

source: Video
ar: فيديو
bn: ভিডিও

source: Reels
ar: ريلز
bn: রিলস

# createPost
source: Create a Post
ar: إنشاء منشور
bn: একটি পোস্ট তৈরি করুন

# yearsExperience
source: {years} years of experience
ar: {years} سنوات الخبرة
bn: {years} বছরের অভিজ্ঞতা

source: No bio available
ar: لا توجد سيرة ذاتية متاحة
bn: কোন বায়ো নেই

source: Message
ar: رسالة
bn: মেসেজ

source: Welcome back
ar: مرحباً بعودتك
bn: স্বাগতম

# loginToAccountAs
source: Please Login to your Account as {userType}
ar: يرجى تسجيل الدخول إلى حسابك كـ {userType}
bn: অনুগ্রহ করে {userType} হিসেবে আপনার অ্যাকাউন্টে লগইন করুন

source: Email Address
ar: بريد إلكتروني
bn: ইমেইল অ্যাড্রেস

source: Password
ar: كلمة المرور
bn: পাসওয়ার্ড

source: Forgot Password?
ar: هل نسيت كلمة المرور؟
bn: পাসওয়ার্ড ভুলে গেছেন?

source: Sign in
ar: تسجيل الدخول
bn: সাইন ইন

# dontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟
bn: আপনার কি কোন অ্যাকাউন্ট নেই?

source: Signup
ar: إنشاء حساب
bn: সাইনআপ

# welcomeBackUser
source: Welcome back, {userName}!
ar: مرحباً بعودتك، {userName}!
bn: স্বাগতম, {userName}!

source: Invalid account type
ar: نوع الحساب غير صالح
bn: অবৈধ অ্যাকাউন্টের ধরণ

# accountRegisteredAs
source: This account is registered as {role}. Please use the correct login option.
ar: هذا الحساب مسجل كـ {role}. يرجى استخدام خيار تسجيل الدخول الصحيح.
bn: এই অ্যাকাউন্টটি {role} হিসেবে নিবন্ধিত। অনুগ্রহ করে সঠিক অপশন ব্যবহার করুন।

# loginFailed
source: Login failed. Please check your credentials.
ar: فشل تسجيل الدخول. يرجى التحقق من بيانات الاعتماد الخاصة بك.
bn: লগইন ব্যর্থ হয়েছে। তথ্য যাচাই করুন।

# enterEmail
source: Please enter your email
ar: يرجى إدخال بريدك الإلكتروني
bn: অনুগ্রহ করে আপনার ইমেইল দিন

# createAccount
source: Create {userType} Account
ar: إنشاء حساب {userType}
bn: {userType} অ্যাকাউন্ট তৈরি করুন

# fillDetails
source: Please fill in the details below
ar: يرجى ملء التفاصيل أدناه
bn: অনুগ্রহ করে নিচের তথ্যগুলো পূরণ করুন

source: Full Name *
ar: الاسم الكامل *
bn: পুরো নাম *

# enterFullName
source: Enter your full name
ar: أدخل اسمك الكامل
bn: আপনার পুরো নাম লিখুন

# emailAddressStar
source: Email Address *
ar: البريد الإلكتروني *
bn: ইমেইল অ্যাড্রেস *

# invalidEmail
source: Please enter a valid email
ar: يرجى إدخال بريد إلكتروني صالح
bn: অনুগ্রহ করে সঠিক ইমেইল দিন

source: Medical License Number *
ar: رقم الترخيص الطبي *
bn: মেডিকেল লাইসেন্স নম্বর *

source: Enter License Number
ar: أدخل رقم الترخيص
bn: লাইসেন্স নম্বর লিখুন

source: Referral Code
ar: رمز الإحالة
bn: রেফারেল কোড

source: Enter Referral Code
ar: أدخل رمز الإحالة
bn: রেফারেল কোড লিখুন

source: Medical Specialty *
ar: التخصص الطبي *
bn: মেডিকেল বিশেষত্ব *

source: Select Specialty
ar: اختر التخصص
bn: আপনার বিশেষত্ব নির্বাচন করুন

# yearsExperienceStar
source: Years of Experience *
ar: سنوات الخبرة *
bn: অভিজ্ঞতার বছর *

# yearsExperienceExample
source: e.g., 5
ar: مثال: 5
bn: যেমন: ৫

# passwordStar
source: Password *
ar: كلمة المرور *
bn: পাসওয়ার্ড *

# passwordLength
source: At least 6 characters
ar: 6 أحرف على الأقل
bn: অন্তত ৬টি অক্ষর

# confirmPasswordStar
source: Confirm Password *
ar: تأكيد كلمة المرور *
bn: পাসওয়ার্ড নিশ্চিত করুন *

# reenterPassword
source: Re-enter your password
ar: أعد إدخال كلمة المرور
bn: আপনার পাসওয়ার্ডটি পুনরায় লিখুন

source: Passwords do not match
ar: كلمات المرور غير متطابقة
bn: পাসওয়ার্ড মিলছে না

# passwordAtLeast6
source: Password must be at least 6 characters
ar: يجب أن تكون كلمة المرور 6 أحرف على الأقل
bn: পাসওয়ার্ড অন্তত ৬ অক্ষরের হতে হবে

# licenseRequired
source: Medical license number is required
ar: رقم الترخيص الطبي مطلوب
bn: মেডিকেল লাইসেন্স নম্বর আবশ্যক

# specialtyRequired
source: Please select a specialty
ar: يرجى اختيار التخصص
bn: অনুগ্রহ করে একটি বিশেষত্ব নির্বাচন করুন

# experienceRequired
source: Years of experience is required
ar: سنوات الخبرة مطلوبة
bn: অভিজ্ঞতার বছর আবশ্যক

source: Registration successful!
ar: تم التسجيل بنجاح!
bn: নিবন্ধন সফল হয়েছে!

# alreadyHaveAccount
source: Already have an account?
ar: لديك حساب بالفعل؟
bn: ইতিমধ্যেই অ্যাকাউন্ট আছে?

# signInLabel
source: Sign In
ar: تسجيل الدخول
bn: সাইন ইন করুন

# createAccountBtn
source: Create Account
ar: إنشاء حساب
bn: অ্যাকাউন্ট তৈরি করুন

# forgotPasswordTitle
source: Forgot Password
ar: نسيت كلمة المرور
bn: পাসওয়ার্ড ভুলে গেছেন

# selectContactReset
source: Select which contact details should we use to reset your password
ar: حدد تفاصيل الاتصال التي يجب أن نستخدمها لإعادة تعيين كلمة المرور الخاصة بك
bn: পাসওয়ার্ড রিসেট করতে কোনটি ব্যবহার করতে চান তা নির্বাচন করুন

# emailLabel
source: Email:
ar: البريد الإلكتروني:
bn: ইমেইল:

source: Enter your email
ar: أدخل بريدك الإلكتروني
bn: আপনার ইমেইল লিখুন

source: Sending...
ar: جاري الإرسال...
bn: পাঠানো হচ্ছে...

# continueText
source: Continue
ar: متابعة
bn: চালিয়ে যান

# otpTitle
source: OTP
ar: رمز التحقق
bn: ওটিপি (OTP)

# sentCodeEmail
source: We have sent you a one time code to your email
ar: لقد أرسلنا لك رمزاً لمرة واحدة إلى بريدك الإلكتروني
bn: আমরা আপনার ইমেইলে একটি ওয়ান-টাইম কোড পাঠিয়েছি

# valid6DigitOtp
source: Please enter a valid 6-digit OTP
ar: يرجى إدخال رمز تحقق صالح من 6 أرقام
bn: অনুগ্রহ করে সঠিক ৬-সংখ্যার ওটিপি দিন

# emailNotFound
source: Email not found. Please restart the process.
ar: البريد الإلكتروني غير موجود. يرجى إعادة بدء العملية.
bn: ইমেইল পাওয়া যায়নি। আবার চেষ্টা করুন।

# otpSentAgain
source: OTP sent again successfully
ar: تم إعادة إرسال رمز التحقق بنجاح
bn: ওটিপি সফলভাবে পুনরায় পাঠানো হয়েছে

# didntGetCode
source: Didn't get the code?
ar: لم يصلك الرمز؟
bn: কোড পাননি?

source: Resend
ar: إعادة إرسال
bn: আবার পাঠান

source: Resending...
ar: جاري إعادة الإرسال...
bn: আবার পাঠানো হচ্ছে...

source: Verifying...
ar: جاري التحقق...
bn: যাচাই করা হচ্ছে...

# resetPasswordTitle
source: Reset Password
ar: إعادة تعيين كلمة المرور
bn: পাসওয়ার্ড রিসেট

# setNewPassword
source: Set the new password for your account
ar: قم بتعيين كلمة مرور جديدة لحسابك
bn: আপনার অ্যাকাউন্টের জন্য নতুন পাসওয়ার্ড সেট করুন

source: New Password
ar: كلمة المرور الجديدة
bn: নতুন পাসওয়ার্ড

source: Confirm Password
ar: تأكيد كلمة المرور
bn: পাসওয়ার্ড নিশ্চিত করুন

# fillAllFields
source: Please fill in all fields
ar: يرجى ملء جميع الحقول
bn: অনুগ্রহ করে সবগুলো ঘর পূরণ করুন

source: Success
ar: نجاح
bn: সফল

# passwordResetSuccess
source: Password has been reset successfully
ar: تم إعادة تعيين كلمة المرور بنجاح
bn: পাসওয়ার্ড সফলভাবে রিসেট করা হয়েছে

source: Resetting...
ar: جاري إعادة التعيين...
bn: রিসেট করা হচ্ছে...

source: Appointment Management
ar: إدارة المواعيد
bn: অ্যাপয়েন্টমেন্ট ম্যানেজমেন্ট

# manageConsultations
source: Manage your Video and physical Consultations
ar: إدارة المشاورات المرئية والجسدية
bn: আপনার ভিডিও এবং ফিজিক্যাল পরামর্শ ম্যানেজ করুন

source: Pending
ar: قيد الانتظار
bn: অপেক্ষমান

source: Confirmed
ar: مؤكد
bn: নিশ্চিত

source: Completed
ar: مكتمل
bn: সম্পন্ন

# noAppointments
source: No {status} appointments
ar: لا توجد مواعيد {status}
bn: কোন {status} অ্যাপয়েন্টমেন্ট নেই

# forDependent
source: For: {name}
ar: من أجل: {name}
bn: জন্য: {name}

source: Physical
ar: جسدي
bn: ফিজিক্যাল

source: See Details
ar: انظر التفاصيل
bn: বিস্তারিত দেখুন

source: Accept
ar: قبول
bn: গ্রহণ করুন

source: Start Session
ar: بدء الجلسة
bn: সেশন শুরু করুন

source: Appointment Details
ar: تفاصيل الموعد
bn: অ্যাপয়েন্টমেন্টের বিস্তারিত

source: Patient Information
ar: معلومات المريض
bn: রোগীর তথ্য

# bookedFor
source: Booked for: {name}
ar: محجوز لـ: {name}
bn: বুক করা হয়েছে: {name}

source: Symptoms
ar: الأعراض
bn: উপসর্গসমূহ

# noSymptoms
source: No symptoms provided
ar: لم يتم تقديم أي أعراض
bn: কোন উপসর্গ দেওয়া হয়নি

source: Medical Documents
ar: المستندات الطبية
bn: মেডিকেল নথিপত্র

# docsUploaded
source: {count} document(s) uploaded
ar: تم تحميل {count} مستند(ات)
bn: {count}টি নথি আপলোড করা হয়েছে

# noDocsUploaded
source: No medical documents uploaded
ar: لم يتم تحميل أي مستندات طبية
bn: কোন মেডিকেল নথি আপলোড করা হয়নি

source: Payment Screenshot
ar: لقطة شاشة الدفع
bn: পেমেন্ট স্ক্রিনশট

source: View Payment Screenshot
ar: عرض لقطة شاشة الدفع
bn: পেমেন্ট স্ক্রিনশট দেখুন

# noPaymentScreenshot
source: No payment screenshot uploaded
ar: لم يتم تحميل لقطة شاشة الدفع
bn: কোন পেমেন্ট স্ক্রিনশট আপলোড করা হয়নি

source: Document URL
ar: رابط المستند
bn: নথির লিঙ্ক

source: Close
ar: إغلاق
bn: বন্ধ করুন

# errorOpeningDoc
source: Error opening document: {error}
ar: خطأ في فتح المستند: {error}
bn: নথি খুলতে ত্রুটি: {error}

source: Cancel Appointment
ar: إلغاء الموعد
bn: অ্যাপয়েন্টমেন্ট বাতিল করুন

# confirmCancel
source: Are you sure you want to cancel this appointment?
ar: هل أنت متأكد أنك تريد إلغاء هذا الموعد؟
bn: আপনি কি নিশ্চিত যে আপনি এই অ্যাপয়েন্টমেন্টটি বাতিল করতে চান?

source: No
ar: لا
bn: না

source: Yes
ar: نعم
bn: হ্যাঁ

# appointmentAccepted
source: Appointment accepted successfully
ar: تم قبول الموعد بنجاح
bn: অ্যাপয়েন্টমেন্ট সফলভাবে গৃহীত হয়েছে

# failedAccept
source: Failed to accept appointment
ar: فشل قبول الموعد
bn: অ্যাপয়েন্টমেন্ট গ্রহণে ব্যর্থ

source: Appointment cancelled
ar: تم إلغاء الموعد
bn: অ্যাপয়েন্টমেন্ট বাতিল করা হয়েছে

source: Cancelled
ar: ملغي
bn: বাতিল

# failedCancel
source: Failed to cancel appointment
ar: فشل إلغاء الموعد
bn: অ্যাপয়েন্টমেন্ট বাতিল করতে ব্যর্থ

source: Loading image...
ar: جاري تحميل الصورة...
bn: ছবি লোড হচ্ছে...

# failedLoadImage
source: Failed to load image
ar: فشل تحميل الصورة
bn: ছবি লোড করতে ব্যর্থ

source: Medical Document
ar: مستند طبي
bn: মেডিকেল নথি

source: Reset Zoom
ar: إعادة تعيين الزووم
bn: জুম রিসেট

# zoomInstructions
source: Pinch to zoom • Drag to pan
ar: قرصة للتكبير • سحب للتحريك
bn: জুম করতে পিঞ্চ করুন • সরাতে ড্র্যাগ করুন

source: Upcoming
ar: القادم
bn: পরবর্তী

source: Up Coming ({count})
ar: القادم ({count})
bn: পরবর্তী ({count})

source: Reschedule
ar: إعادة جدولة
bn: রিসেডিউল

source: Write Review
ar: اكتب تقييمًا
bn: রিভিউ লিখুন

# updateReview
source: Update Your Review
ar: تحديث تقييمك
bn: রিভিউ আপডেট করুন

# rateExperience
source: Rate Your Experience
ar: قيم تجربتك
bn: আপনার অভিজ্ঞতা মূল্যায়ন করুন

# withDoctor
source: with {name}
ar: مع {name}
bn: {name} এর সাথে

# reviewSubmitted
source: Review submitted successfully! ⭐
ar: تم تقديم التقييم بنجاح!
bn: রিভিউ সফলভাবে জমা দেওয়া হয়েছে! ⭐

# failedSubmitReview
source: Failed to submit review
ar: فشل في تقديم التقييم
bn: রিভিউ জমা দিতে ব্যর্থ

source: Submit
ar: إرسال
bn: জমা দিন

source: Doctor
ar: طبيب
bn: ডাক্তার

# videoAvailable
source: Video Consultation Available
ar: الاستشارة المرئية متاحة
bn: ভিডিও পরামর্শ উপলব্ধ

source: In-Person Only
ar: حضور شخصي فقط
bn: শুধুমাত্র সরাসরি ভিজিট

# reviewsCount
source: ({count} reviews)
ar: ({count} تقييمات)
bn: ({count}টি রিভিউ)

source: Bio
ar: السيرة الذاتية
bn: বায়ো

source: Specialty
ar: التخصص
bn: বিশেষত্ব

source: Degree
ar: الدرجة العلمية
bn: ডিগ্রি

source: Fees
ar: الرسوم
bn: ফি

source: DZD
ar: د.ج

source: Visiting Hours
ar: ساعات الزيارة
bn: পরিদর্শনের সময়

source: Not set
ar: غير محدد
bn: সেট করা নেই

source: Message Doctor
ar: مراسلة الطبيب
bn: ডাক্তারকে মেসেজ দিন

source: Invalid Doctor
ar: طبيب غير صالح
bn: অবৈধ ডাক্তার

source: Doctor ID not found
ar: معرف الطبيب غير موجود
bn: ডাক্তার আইডি পাওয়া যায়নি

# failedCreateChat
source: Failed to create chat
ar: فشل في إنشاء الدردشة
bn: চ্যাট তৈরি করতে ব্যর্থ

# failedOpenChat
source: Failed to open chat
ar: فشل في فتح الدردشة
bn: চ্যাট খুলতে ব্যর্থ

source: Physical Visit
ar: زيارة في العيادة
bn: সরাসরি ভিজিট

source: Video Call
ar: مكالمة فيديو
bn: ভিডিও কল

source: Reschedule Appointment
ar: إعادة جدولة الموعد
bn: অ্যাপয়েন্টমেন্ট রিসেডিউল করুন

source: Book Appointment
ar: حجز موعد
bn: অ্যাপয়েন্টমেন্ট বুক করুন

# rescheduleBanner
source: You are rescheduling your appointment. Old appointment will be cancelled.
ar: أنت تقوم بإعادة جدولة موعدك. سيتم إلغاء الموعد القديم.

# videoUploadWarning
source: Video appointments- patient must upload BaridiMob payment screenshot
ar: المواعيد المرئية - يجب على المريض تحميل لقطة شاشة لعملية دفع BaridiMob
bn: ভিডিও অ্যাপয়েন্টমেন্ট- রোগীকে অবশ্যই পেমেন্ট স্ক্রিনশট আপলোড করতে হবে

# appointmentTypeLabel
source: Appointment Type
ar: نوع الموعد
bn: অ্যাপয়েন্টমেন্টের ধরণ

source: Pay at Clinic
ar: الدفع في العيادة
bn: ক্লিনিকে পেমেন্ট করুন

source: Online Payment
ar: الدفع عبر الإنترنت
bn: অনলাইন পেমেন্ট

source: Book Appointment For
ar: حجز موعد لـ
bn: অ্যাপয়েন্টমেন্ট বুকিং যার জন্য

source: Myself
ar: نفسي
bn: আমি নিজে

# orSelectDependent
source: Or select a dependent:
ar: أو اختر أحد التابعين:
bn: অথবা নির্ভরশীল কাউকে নির্বাচন করুন:

source: Add New Dependent
ar: إضافة تابع جديد
bn: নতুন নির্ভরশীল যোগ করুন

source: Select Date
ar: اختر التاريخ
bn: তারিখ নির্বাচন করুন

# datePlaceholder
source: dd/mm/yyyy
ar: يوم/شهر/سنة
bn: দিন/মাস/বছর

source: Available Time
ar: الوقت المتاح
bn: উপলব্ধ সময়

# noTimeSlots
source: No available time slots for this date
ar: لا توجد مواعيد متاحة لهذا التاريخ
bn: এই তারিখে কোন সময় খালি নেই

# timeTo
source: To
ar: إلى
bn: পর্যন্ত

source: Booked
ar: محجوز
bn: বুক করা আছে

# describeSymptoms
source: Describe your Symptoms
ar: صف أعراضك
bn: আপনার উপসর্গগুলো বর্ণনা করুন

# symptomsHint
source: Please describe your symptoms in detail....
ar: يرجى وصف أعراضك بالتفصيل....
bn: অনুগ্রহ করে আপনার উপসর্গগুলো বিস্তারিত বর্ণনা করুন....

# uploadMedicalDocs
source: Upload Medical Documents
ar: تحميل المستندات الطبية
bn: মেডিকেল নথি আপলোড করুন

# tapToUpload
source: Tap to Upload image or PDF
ar: اضغط لتحميل صورة أو ملف PDF
bn: ছবি বা পিডিএফ আপলোড করতে ট্যাপ করুন

source: Upload Payment Screenshot
ar: تحميل لقطة شاشة عملية الدفع
bn: পেমেন্ট স্ক্রিনশট আপলোড করুন

# tapToUploadPayment
source: Tap to Upload Your Payment Screenshot
ar: اضغط لتحميل لقطة شاشة الدفع الخاصة بك
bn: পেমেন্ট স্ক্রিনশট আপলোডের জন্য ট্যাপ করুন

source: Confirm Reschedule
ar: تأكيد إعادة الجدولة
bn: রিসেডিউল নিশ্চিত করুন

source: Submit Appointment Request
ar: إرسال طلب الموعد
bn: অ্যাপয়েন্টমেন্ট অনুরোধ জমা দিন

# invalidDoctorBooking
source: Invalid Doctor – Cannot book appointment
ar: طبيب غير صالح - لا يمكن حجز موعد

# selectDateTime
source: Please select date and time
ar: يرجى اختيار التاريخ والوقت
bn: অনুগ্রহ করে তারিখ ও সময় নির্বাচন করুন

# rescheduleFailed
source: Reschedule failed: {error}
ar: فشلت إعادة الجدولة: {error}

# paymentRequired
source: Payment screenshot required for Video Call
ar: لقطة شاشة الدفع مطلوبة لاستشارة الفيديو
bn: ভিডিও কলের জন্য পেমেন্ট স্ক্রিনশট আবশ্যক

source: Booking failed
ar: فشل الحجز
bn: বুকিং ব্যর্থ হয়েছে

source: Complete Session
ar: إتمام الجلسة
bn: সেশন সম্পন্ন করুন

# sessionCompleted
source: Session completed successfully! ✅
ar: تم إتمام الجلسة بنجاح! ✅
bn: সেশন সফলভাবে সম্পন্ন হয়েছে! ✅

# failedCompleteSession
source: Failed to complete session
ar: فشل في إتمام الجلسة
bn: সেশন সম্পন্ন করতে ব্যর্থ

source: Session Payment Details
ar: تفاصيل دفع الجلسة
bn: সেশন পেমেন্ট বিস্তারিত

# enterSessionDetails
source: Enter the details to complete this session
ar: أدخل التفاصيل لإتمام هذه الجلسة
bn: সেশন সম্পন্ন করতে বিস্তারিত তথ্য দিন

source: Patient Full Name
ar: الاسم الكامل للمريض
bn: রোগীর পুরো নাম

# enterPatientName
source: Enter patient's full name
ar: أدخل الاسم الكامل للمريض
bn: রোগীর পুরো নাম লিখুন

# patientNameRequired
source: Please enter patient name
ar: يرجى إدخال اسم المريض
bn: অনুগ্রহ করে রোগীর নাম লিখুন

# payableAmount
source: Payable Amount (DZD)
ar: المبلغ المستحق (د.ج)
bn: প্রদেয় পরিমাণ (DZD)

source: Enter amount received
ar: أدخل المبلغ المستلم
bn: প্রাপ্ত পরিমাণ লিখুন

# amountRequired
source: Please enter amount
ar: يرجى إدخال المبلغ
bn: অনুগ্রহ করে পরিমাণ লিখুন

# validAmountRequired
source: Please enter a valid amount
ar: يرجى إدخال مبلغ صالح
bn: অনুগ্রহ করে সঠিক পরিমাণ লিখুন

# notificationTitle
source: Notification
ar: إشعار
bn: নোটিফিকেশন

# notificationsTitle
source: Notifications
ar: إشعارات
bn: নোটিফিকেশনসমূহ

source: Mark all as read
ar: تحديد الكل كمقروء
bn: সবগুলো পঠিত হিসেবে চিহ্নিত করুন

# newNotifications
source: New
ar: جديد
bn: নতুন

# earlierNotifications
source: Earlier
ar: سابقاً
bn: আগে

source: No notifications
ar: لا توجد إشعارات
bn: কোন নোটিফিকেশন নেই

source: No notifications yet
ar: لا توجد إشعارات بعد
bn: এখনো কোন নোটিফিকেশন নেই

# doctorNotificationEmptySubtitle
source: We'll notify you when a patient books or updates an appointment.
ar: سنخطرك عندما يقوم مريض بحجز أو تحديث موعد.
bn: কোন রোগী অ্যাপয়েন্টমেন্ট বুক বা আপডেট করলে আমরা আপনাকে জানাব।

source: Upcoming Patient
ar: المريض القادم
bn: পরবর্তী রোগী

# addTextOrMedia
source: Please add some text or media to post
ar: يرجى إضافة نص أو وسائط للنشر

source: Reel Privacy
ar: خصوصية Reel

# reelVisibleDoctorsOnly
source: 🔒 This reel will be visible to doctors only.
ar: 🔒 سيكون هذا الـ reel مرئياً للأطباء فقط.

# reelVisibleEveryone
source: 🌍 This reel will be visible to everyone (doctors and patients).
ar: 🌍 سيكون هذا الـ reel مرئياً للجميع (الأطباء والمرضى).

# currentPrivacy
source: Current privacy: {privacy}
ar: الخصوصية الحالية: {privacy}

source: Private (Doctors Only)
ar: خاص (للأطباء فقط)

source: Public (Everyone)
ar: عام (للجميع)

source: Upload Reel
ar: تحميل Reel
bn: রিল আপলোড করুন

# privateReelUploaded
source: ✓ Private reel uploaded! (Doctors only)
ar: ✓ تم تحميل Reel خاص! (للأطباء فقط)

# publicReelUploaded
source: ✓ Public reel uploaded! (Everyone can see)
ar: ✓ تم تحميل Reel عام! (يمكن للجميع رؤيته)

# failedUploadReel
source: Failed to upload reel
ar: فشل تحميل الـ reel
bn: রিল আপলোড করতে ব্যর্থ

source: ✓ Post shared successfully!
ar: ✓ تم مشاركة المنشور بنجاح!
bn: ✓ পোস্ট সফলভাবে শেয়ার করা হয়েছে!

# failedCreatePost
source: Failed to create post
ar: فشل في إنشاء المنشور
bn: পোস্ট তৈরি করতে ব্যর্থ

source: What's on your mind?.......
ar: بماذا تفكر؟.......
bn: আপনার মনের কথা কি?.......

source: Video Selected
ar: تم اختيار الفيديو
bn: ভিডিও নির্বাচিত

# failedLikePost
source: Failed to like post
ar: فشل في الإعجاب بالمنشور
bn: পোস্টে লাইক দিতে ব্যর্থ

source: Delete Post
ar: حذف المنشور
bn: পোস্ট মুছে ফেলুন

source: Report Post
ar: الإبلاغ عن المنشور
bn: রিপোর্ট করুন

source: Report - Coming soon!
ar: الإبلاغ - قريباً!

# confirmDeletePost
source: Are you sure you want to delete this post?
ar: هل أنت متأكد أنك تريد حذف هذا المنشور؟
bn: আপনি কি নিশ্চিত যে আপনি এই পোস্টটি মুছে ফেলতে চান?

source: Delete
ar: حذف
bn: মুছুন

source: ✓ Post deleted successfully
ar: ✓ تم حذف المنشور بنجاح
bn: ✓ পোস্ট সফলভাবে মুছে ফেলা হয়েছে

# failedDeletePost
source: Failed to delete post
ar: فشل في حذف المنشور
bn: পোস্ট মুছে ফেলতে ব্যর্থ

source: Share Post
ar: مشاركة المنشور
bn: পোস্ট শেয়ার করুন
