Repository: Yeasin84/appointmrnt-booking-app
Catalog: lib/l10n/app_*.arb
Languages: ar, bn

source: Share Externally
ar: مشاركة خارجيًا
bn: বাইরে শেয়ার করুন

source: Send Message
ar: إرسال رسالة
bn: মেসেজ পাঠান

# shareMessageComingSoon
source: Share to message - Coming soon!
ar: المشاركة في رسالة - قريباً!

# authorPosted
source: {name} posted:
ar: نشر {name}:
bn: {name} পোস্ট করেছেন:

# imagesCount
source: {count} image(s)
ar: {count} صورة
bn: {count}টি ছবি

# videosCount
source: {count} video(s)
ar: {count} فيديو
bn: {count}টি ভিডিও

source: No comments yet
ar: لا توجد تعليقات بعد
bn: এখনো কোন মন্তব্য নেই

# writeComment
source: Write a comment...
ar: اكتب تعليقاً...
bn: একটি মন্তব্য লিখুন...

# likeLabel
source: Like
ar: إعجاب
bn: লাইক

# commentLabel
source: Comment
ar: تعليق
bn: কমেন্ট

# shareLabel
source: Share
ar: مشاركة
bn: শেয়ার

# likesCount
source: {count} {count, plural, =1{like} other{likes}}
ar: {count} إعجاب
bn: {count}টি লাইক

# commentsCount
source: {count} {count, plural, =1{comment} other{comments}}
ar: {count} تعليق
bn: {count}টি কমেন্ট

# sharesCount
source: {count} {count, plural, =1{share} other{shares}}
ar: {count} مشاركة
bn: {count}টি শেয়ার

source: Post
ar: نشر

# commentsLabel
source: Comments
ar: التعليقات
bn: কমেন্টসমূহ

# reelsLabel
source: Reels
ar: ريلز
bn: রিলস

# failedLoadReels
source: Failed to load reels
ar: فشل تحميل الريلز
bn: রিল লোড করতে ব্যর্থ

# retryLabel
source: Retry
ar: إعادة المحاولة
bn: আবার চেষ্টা করুন

source: No reels available
ar: لا يوجد ريلز متوفرة
bn: কোন রিল উপলব্ধ নেই

source: Unknown Doctor
ar: طبيب غير معروف
bn: অজানা ডাক্তার

source: Unknown
ar: غير معروف
bn: অজানা

# doctorsOnlyLabel
source: Doctors Only
ar: للأطباء فقط
bn: শুধুমাত্র ডাক্তারদের জন্য

# failedLikeReel
source: Failed to like reel
ar: فشل الإعجاب بالريل
bn: রিল লাইক করতে ব্যর্থ

# authorSharedReel
source: {name} shared a reel
ar: {name} شارك ريل
bn: {name} একটি রিল শেয়ার করেছেন

# playbackSpeed
source: {speed}x Speed
ar: سرعة {speed}x
bn: {speed}x গতি

source: Just now
ar: الآن
bn: এইমাত্র

# messagesLabel
source: Messages
ar: الرسائل
bn: মেসেজ

# allLabel
source: All
ar: الكل
bn: সব

# doctorsLabel
source: Doctors
ar: الأطباء
bn: ডাক্তাররা

# patientsLabel
source: Patients
ar: المرضى
bn: রোগীরা

source: No messages yet
ar: لا توجد رسائل بعد
bn: এখনো কোন মেসেজ নেই

source: No conversations yet
ar: لا توجد محادثات بعد
bn: এখনো কোন চ্যাট নেই

source: Delete Chats
ar: حذف المحادثات
bn: চ্যাট মুছে ফেলুন

source: Delete Messages
ar: حذف الرسائل
bn: মেসেজ মুছে ফেলুন

# deleteConversationsConfirm
source: Are you sure you want to delete {count} conversations? This will remove all messages.
ar: هل أنت متأكد أنك تريد حذف {count} محادثات؟ سيؤدي هذا إلى إزالة جميع الرسائل.

# deleteMessagesConfirm
source: Are you sure you want to delete {count} messages?
ar: هل أنت متأكد أنك تريد حذف {count} رسائل؟

# deleteLabel
source: Delete
ar: حذف
bn: মুছুন

source: Conversations deleted
ar: تم حذف المحادثات
bn: চ্যাটগুলো মুছে ফেলা হয়েছে

source: Messages deleted
ar: تم حذف الرسائل
bn: মেসেজগুলো মুছে ফেলা হয়েছে

# failedToDelete
source: Failed to delete: {error}
ar: فشل الحذف: {error}
bn: মুছে ফেলতে ব্যর্থ: {error}

# startConversationWith
source: Start a conversation with {name}
ar: ابدأ محادثة مع {name}

source: Type a message...
ar: اكتب رسالة...
bn: একটি মেসেজ লিখুন...

source: Failed to send message
ar: فشل إرسال الرسالة
bn: মেসেজ পাঠাতে ব্যর্থ

# cannotStartCallNoId
source: Cannot start call - user ID not found
ar: لا يمكن بدء المكالمة - معرف المستخدم غير موجود

# failedToStartCall
source: Failed to start call: {error}
ar: فشل بدء المكالمة: {error}
bn: কল শুরু করতে ব্যর্থ: {error}

# doctorUnavailableForCalls
source: Doctor is not available for calls at this time
ar: الطبيب غير متاح للمكالمات في هذا الوقت

# doctorUnavailableForCallsDescription
source: The doctor is not available for {type} calls. You can send a message or try again later.
ar: الطبيب غير متاح لمكالمات {type}. يمكنك إرسال رسالة أو المحاولة مرة أخرى لاحقًا.

source: Voice Call
ar: مكالمة صوتية
bn: ভয়েস কল

source: Audio/Video Calls
ar: المكالمات الصوتية/المرئية

# imageLabel
source: [Image]
ar: [صورة]

# fileLabel
source: [File]
ar: [ملف]

# messageLabel
source: [Message]
ar: [رسالة]

source: Yesterday
ar: أمس
bn: গতকাল

# todayLabel
source: Today
ar: اليوم
bn: আজ

# daysAgo
source: {count}d ago
ar: منذ {count} يوم
bn: {count} দিন আগে

# hoursAgo
source: {count}h ago
ar: منذ {count} ساعة
bn: {count} ঘণ্টা আগে

# minutesAgo
source: {count}m ago
ar: منذ {count} دقيقة
bn: {count} মিনিট আগে

# meLabel
source: Me
ar: أنا
bn: আমি

# patientLabel
source: Patient
ar: مريض
bn: রোগী

# doctorLabel
source: Doctor
ar: طبيب
bn: ডাক্তার

source: Start conversation
ar: بدء المحادثة
bn: কথা বলা শুরু করুন

source: Help & Support - Coming Soon
ar: المساعدة والدعم - قريباً

# noDependentsAdded
source: No dependents added yet
ar: لم يتم إضافة معالين بعد
bn: এখনো কেউ যুক্ত নেই

source: Add Dependent
ar: إضافة معال
bn: নির্ভরশীল যোগ করুন

source: Edit Dependent
ar: تعديل المعال
bn: সম্পাদনা করুন

source: Inactive
ar: غير نشط
bn: নিষ্ক্রিয়

source: Active
ar: نشط
bn: সক্রিয়

# ageLabel
source: Age
ar: العمر
bn: বয়স

# genderLabel
source: Gender
ar: الجنس
bn: লিঙ্গ

# contactLabel
source: Contact
ar: جهة الاتصال
bn: যোগাযোগ

# deleteDependentTitle
source: Delete Dependent?
ar: حذف المعال؟
bn: মুছে ফেলবেন?

# deleteDependentConfirm
source: Are you sure you want to delete "{name}"?
ar: هل أنت متأكد أنك تريد حذف "{name}"؟

# deleteDependentWarning
source: If they have active appointments, you must cancel those first.
ar: إذا كان لديهم مواعيد نشطة، يجب عليك إلغاؤها أولاً.

# cannotDeleteTitle
source: Cannot Delete
ar: تعذر الحذف

source: How to fix:
ar: كيفية الإصلاح:
bn: কিভাবে ঠিক করবেন:

# deleteFixInstructions
source: 1. Go to My Appointments 2. Cancel any pending/accepted appointments for this dependent 3. Then try deleting again
ar: 1. انتقل إلى مواعيدي 2. قم بإلغاء أي مواعيد معلقة/مقبولة لهذا المعال 3. ثم حاول الحذف مرة أخرى

source: Go to Appointments
ar: انتقل إلى المواعيد
bn: অ্যাপয়েন্টমেন্টে যান

# dependentDeletedSuccess
source: {name} deleted successfully
ar: تم حذف {name} بنجاح
bn: {name} সফলভাবে মুছে ফেলা হয়েছে

# dependentAddedSuccess
source: Dependent added successfully!
ar: تم إضافة المعال بنجاح!
bn: সফলভাবে যুক্ত করা হয়েছে!

# dependentUpdatedSuccess
source: Dependent updated successfully!
ar: تم تحديث المعال بنجاح!
bn: সফলভাবে আপডেট করা হয়েছে!

source: Failed to add dependent
ar: فشل في إضافة المعال
bn: যোগ করতে ব্যর্থ

source: Failed to update dependent
ar: فشل في تحديث المعال
bn: আপডেট করতে ব্যর্থ

source: Basic Information
ar: معلومات أساسية
bn: প্রাথমিক তথ্য

source: Name is required
ar: الاسم مطلوب
bn: নাম আবশ্যক

# selectRelationship
source: Please select relationship
ar: يرجى اختيار صلة القرابة
bn: সম্পর্ক নির্বাচন করুন

# selectDob
source: Please select date of birth
ar: يرجى اختيار تاريخ الميلاد
bn: জন্ম তারিখ নির্বাচন করুন

# relationshipLabel
source: Relationship
ar: صلة القرابة
bn: সম্পর্ক

# relationshipHint
source: Relationship (e.g. Child, Spouse)
ar: صلة القرابة (مثلاً: طفل، زوج)
bn: সম্পর্ক (যেমন: সন্তান, স্বামী/স্ত্রী)

source: Contact Details
ar: تفاصيل الاتصال
bn: যোগাযোগের বর্ণনা

# guardianContactLabel
source: Parent/Guardian Contact (Primary)
ar: جهة اتصال ولي الأمر (أساسي)
bn: অভিভাবকের যোগাযোগ

# userInfoWillBeUsed
source: Your user info will be used
ar: سيتم استخدام معلومات المستخدم الخاصة بك

# dependentContactHint
source: Dependent's Contact (if applicable)
ar: جهة اتصال المعال (إن وجد)

source: Additional Information
ar: معلومات إضافية
bn: অতিরিক্ত তথ্য

# medicalNotesHint
source: Medical Notes / Allergies (Optional)
ar: ملاحظات طبية / حساسيات (اختياري)
bn: মেডিকেল নোট / অ্যালার্জি (ঐচ্ছিক)

source: Save Dependent
ar: حفظ المعال
bn: সেভ করুন

source: Update Dependent
ar: تحديث المعال
bn: আপডেট করুন

# relChild
source: Child
ar: طفل
bn: সন্তান

# relSpouse
source: Spouse
ar: زوج/زوجة
bn: স্বামী/স্ত্রী

# relFather
source: Father
ar: أب
bn: বাবা

# relMother
source: Mother
ar: أم
bn: মা

# relBrother
source: Brother
ar: أخ
bn: ভাই

# relSister
source: Sister
ar: أخت
bn: বোন

# relGrandparent
source: Grandparent
ar: جد/جدة
bn: দাদা-দাদী/নানা-নানী

# relOther
source: Other
ar: آخر
bn: অন্যান্য

# relSon
source: Son
ar: ابن
bn: ছেলে

# relDaughter
source: Daughter
ar: ابنة
bn: মেয়ে

source: Male
ar: ذكر
bn: পুরুষ

source: Female
ar: أنثى
bn: মহিলা

source: Edit
ar: تعديل
bn: সম্পাদনা

source: Date of Birth
ar: تاريخ الميلاد
bn: জন্ম তারিখ

source: Edit Your Profile
ar: تعديل ملفك الشخصي
bn: প্রোফাইল সম্পাদন করুন

source: Profile Picture
ar: الصورة الشخصية
bn: প্রোফাইল ছবি

# tapToChangePicture
source: Tap to Change your Picture
ar: انقر لتغيير صورتك
bn: ছবি পরিবর্তনের জন্য ট্যাপ করুন

source: Phone Number
ar: رقم الهاتف
bn: ফোন নম্বর

source: Address
ar: العنوان
bn: ঠিকানা

source: Update Profile
ar: تحديث الملف الشخصي
bn: প্রোফাইল আপডেট করুন

# profileUpdatedSuccess
source: Profile updated successfully
ar: تم تحديث الملف الشخصي بنجاح
bn: প্রোফাইল সফলভাবে আপডেট করা হয়েছে

source: Update failed
ar: فشل التحديث
bn: আপডেট ব্যর্থ হয়েছে

# nameEmptyError
source: Name cannot be empty
ar: لا يمكن أن يكون الاسم فارغاً
bn: নাম খালি রাখা যাবে না

source: No changes to save
ar: لا توجد تغييرات لحفظها
bn: সেভ করার মতো কোন পরিবর্তন নেই

# errorMsg
source: Error: {error}
ar: خطأ: {error}
bn: ত্রুটি: {error}

source: Add Bio
ar: إضافة نبذة شخصية
bn: বায়ো যোগ করুন

# bioHint
source: Tell us about yourself...
ar: أخبرنا عن نفسك...
bn: আপনার সম্পর্কে বলুন...

# degreeHint
source: MBBS, MD, etc.
ar: بكالوريوس طب، دكتوراه، إلخ.
bn: MBBS, MD, ইত্যাদি

# emailLockedNote
source: Email cannot be changed
ar: لا يمكن تغيير البريد الإلكتروني
bn: ইমেইল পরিবর্তন করা যাবে না

source: Clinic Location
ar: موقع العيادة
bn: ক্লিনিকের অবস্থান

# clinicLocationHint
source: Set your clinic location
ar: حدد موقع عيادتك
bn: আপনার ক্লিনিকের অবস্থান সেট করুন

# contactNumberHint
source: Contact number
ar: رقم الاتصال
bn: যোগাযোগ নম্বর

# specCardiologist
source: Cardiologist
ar: طبيب قلب
bn: হৃদরোগ বিশেষজ্ঞ (Cardiologist)

# specDermatologist
source: Dermatologist
ar: طبيب جلدية
bn: চর্মরোগ বিশেষজ্ঞ (Dermatologist)

# specNeurologist
source: Neurologist
ar: طبيب أعصاب
bn: নিউরোলজিস্ট (Neurologist)

# specOrthopedic
source: Orthopedic
ar: طبيب عظام
bn: অস্থিরোগ বিশেষজ্ঞ (Orthopedic)

# specPediatrician
source: Pediatrician
ar: طبيب أطفال
bn: শিশু বিশেষজ্ঞ (Pediatrician)

# specPsychiatrist
source: Psychiatrist
ar: طبيب نفسي
bn: মানসিক রোগ বিশেষজ্ঞ (Psychiatrist)

# specGeneralPhysician
source: General Physician
ar: ممارس عام
bn: জেনারেল ফিজিশিয়ান

# specENT
source: ENT Specialist
ar: أخصائي أنف وأذن وحنجرة
bn: নাক, কান, গলা বিশেষজ্ঞ (ENT)

# specGynecologist
source: Gynecologist
ar: طبيب نساء وتوليد
bn: স্ত্রীরোগ বিশেষজ্ঞ (Gynecologist)

# specOphthalmologist
source: Ophthalmologist
ar: طبيب عيون
bn: চক্ষুরোগ বিশেষজ্ঞ (Ophthalmologist)

# specDentist
source: Dentist
ar: طبيب أسنان
bn: দন্ত চিকিৎসক (Dentist)

# specUrologist
source: Urologist
ar: طبيب مسالك بولية
bn: ইউরোলজিস্ট (Urologist)

# statusLabel
source: Status
ar: الحالة
bn: স্ট্যাটাস

source: Change Password
ar: تغيير كلمة المرور
bn: পাসওয়ার্ড পরিবর্তন

# passwordLengthRequirement
source: Password must be at least 6 characters long
ar: يجب أن تتكون كلمة المرور من 6 أحرف على الأقل
bn: পাসওয়ার্ড অন্তত ৬ অক্ষরের হতে হবে

source: Current Password
ar: كلمة المرور الحالية
bn: বর্তমান পাসওয়ার্ড

source: Enter current password
ar: أدخل كلمة المرور الحالية
bn: বর্তমান পাসওয়ার্ড লিখুন

source: Enter new password
ar: أدخل كلمة المرور الجديدة
bn: নতুন পাসওয়ার্ড লিখুন

source: Confirm New Password
ar: تأكيد كلمة المرور الجديدة
bn: নতুন পাসওয়ার্ড নিশ্চিত করুন

source: Re-enter new password
ar: أعد إدخال كلمة المرور الجديدة
bn: নতুন পাসওয়ার্ড পুনরায় লিখুন

# passwordsDoNotMatchError
source: New password and confirm password do not match
ar: كلمة المرور الجديدة وتأكيدها غير متطابقين
bn: নতুন পাসওয়ার্ড এবং নিশ্চিত পাসওয়ার্ড মিলছে না

# passwordChangedSuccess
source: Password changed successfully
ar: تم تغيير كلمة المرور بنجاح
bn: পাসওয়ার্ড সফলভাবে পরিবর্তন করা হয়েছে

# changePasswordFailed
source: Failed to change password
ar: فشل تغيير كلمة المرور
bn: পাসওয়ার্ড পরিবর্তনে ব্যর্থ

source: Earning Overview
ar: نظرة عامة على الأرباح
bn: আয়ের সংক্ষিপ্ত বিবরণ

# trackIncomeSubtitle
source: Track your income across all appointment types.
ar: تتبع دخلك في جميع أنواع المواعيد.
bn: আপনার সব ধরণের অ্যাপয়েন্টমেন্ট থেকে আয় ট্র্যাক করুন।

source: Daily
ar: يومي
bn: দৈনিক

source: Weekly
ar: أسبوعي
bn: সাপ্তাহিক

source: Monthly
ar: شهري
bn: মাসিক

source: Total Earning
ar: إجمالي الأرباح
bn: মোট আয়

# appointmentsCount
source: {count} appointments
ar: {count} المواعيد
bn: {count}টি অ্যাপয়েন্টমেন্ট

# sessionsCount
source: {count} sessions
ar: {count} جلسات
bn: {count}টি সেশন

source: Weekly Performance
ar: الأداء الأسبوعي
bn: সাপ্তাহিক পারফরম্যান্স

# failedFetchEarnings
source: Failed to fetch earnings
ar: فشل في جلب الأرباح
bn: আয় আনতে ব্যর্থ

source: Online Appointment
ar: مواعيد عبر الإنترنت
bn: অনলাইন অ্যাপয়েন্টমেন্ট

# consultationFees
source: Consultation Fees (DZD)
ar: رسوم الاستشارة (دز)
bn: পরামর্শ ফি (DZD)

source: Weekly Schedule
ar: الجدول الأسبوعي
bn: সাপ্তাহিক শিডিউল

source: Add New Slot
ar: إضافة موعد جديد
bn: নতুন স্লট যোগ করুন

source: Save Changes
ar: حفظ التغييرات
bn: পরিবর্তনগুলো সেভ করুন

# endTimeError
source: End time must be after start time
ar: يجب أن يكون وقت النهاية بعد وقت البدء
bn: শেষ সময় অবশ্যই শুরু সময়ের পরে হতে হবে

# enterConsultationFees
source: Please enter consultation fees
ar: يرجى إدخال رسوم الاستشارة
bn: অনুগ্রহ করে পরামর্শ ফি লিখুন

# scheduleSavedSuccess
source: Schedule saved successfully!
ar: تم حفظ الجدول بنجاح!
bn: শিডিউল সফলভাবে সেভ করা হয়েছে!

source: To
ar: إلى
bn: থেকে

source: Select Start Time
ar: اختيار وقت البدء
bn: শুরুর সময় নির্বাচন করুন

source: Select End Time
ar: اختيار وقت النهاية
bn: শেষ সময় নির্বাচন করুন

# selectTimeFromPicker
source: Please select time from the picker below
ar: يرجى اختيار الوقت من المختار بالأسفل
bn: অনুগ্রহ করে নিচের পিকার থেকে সময় নির্বাচন করুন

# notif_appointment_booked_title
source: New Appointment Request
ar: طلب موعد جديد
bn: নতুন অ্যাপয়েন্টমেন্ট অনুরোধ

# notif_appointment_booked_body
source: You have a new appointment request from a patient.
ar: لديك طلب موعد جديد من مريض.
bn: আপনার কাছে একজন রোগীর থেকে নতুন একটি অ্যাপয়েন্টমেন্ট অনুরোধ এসেছে।

# notif_appointment_confirmed_title
source: Appointment Confirmed
ar: تم تأكيد الموعد
bn: অ্যাপয়েন্টমেন্ট নিশ্চিত

# notif_appointment_confirmed_body
source: Your appointment with the doctor has been confirmed.
ar: تم تأكيد موعدك مع الطبيب.
bn: ডাক্তারের সাথে আপনার অ্যাপয়েন্টমেন্ট নিশ্চিত করা হয়েছে।

# notif_appointment_cancelled_title
source: Appointment Cancelled
ar: تم إلغاء الموعد
bn: অ্যাপয়েন্টমেন্ট বাতিল

# notif_appointment_cancelled_body
source: An appointment has been cancelled.
ar: تم إلغاء موعد.
bn: একটি অ্যাপয়েন্টমেন্ট বাতিল করা হয়েছে।

# notif_appointment_completed_title
source: Appointment Completed
ar: اكتمل الموعد
bn: অ্যাপয়েন্টমেন্ট সম্পন্ন

# notif_appointment_completed_body
source: Your appointment has been marked as completed.
ar: تم وضع علامة على موعدك كمكتمل.
bn: আপনার অ্যাপয়েন্টমেন্টটি সম্পন্ন হিসেবে চিহ্নিত করা হয়েছে।

# notif_post_liked_title
source: New Like
ar: إعجاب جديد
bn: নতুন লাইক

# notif_post_liked_body
source: Someone liked your post.
ar: أعجب شخص ما بمنشورك.
bn: কেউ আপনার পোস্টে লাইক দিয়েছে।

# notif_post_commented_title
source: New Comment
ar: تعليق جديد

# notif_post_commented_body
source: Someone commented on your post.
ar: علق شخص ما على منشورك.

# notif_reel_liked_title
source: New Reel Like
ar: إعجاب جديد على الريل

# notif_reel_liked_body
source: Someone liked your reel.
ar: أعجب شخص ما بالريل الخاص بك.

# notif_reel_commented_title
source: New Reel Comment
ar: تعليق جديد على الريل

# notif_reel_commented_body
source: Someone commented on your reel.
ar: علق شخص ما على الريل الخاص بك.

# faqTitle
source: Frequently Asked Questions (FAQ)
ar: الأسئلة المتداولة (FAQ)
bn: সাধারণ জিজ্ঞাসা (FAQ)

# faq1Question
source: 1. How do I create an account?
ar: 1. كيف يمكنني إنشاء حساب؟
bn: ১. আমি কিভাবে একটি অ্যাকাউন্ট তৈরি করব?

# faq1Answer
source: You can sign up as a patient or doctor by choosing your role and completing the registration steps in the app.
ar: يمكنك التسجيل كطبيب أو مريض من خلال اختيار دورك وإكمال خطوات التسجيل في التطبيق.
bn: আপনি অ্যাপে আপনার ভূমিকা নির্বাচন করে এবং নিবন্ধনের ধাপগুলো সম্পন্ন করে রোগী বা ডাক্তার হিসেবে সাইন আপ করতে পারেন।

# faq2Question
source: 2. I forgot my password. What should I do?
ar: 2. لقد نسيت كلمة المرور الخاصة بي. ماذا أفعل؟
bn: ২. আমি আমার পাসওয়ার্ড ভুলে গেছি। আমার কী করা উচিত?

# faq2Answer
source: Go to the login screen and tap on “Forgot Password”. Follow the instructions to reset your password securely.
ar: انتقل إلى شاشة تسجيل الدخول واضغط على "نسيت كلمة المرور". اتبع التعليمات لإعادة تعيين كلمة المرور الخاصة بك بشكل آمن.
bn: লগইন স্ক্রিনে যান এবং "পাসওয়ার্ড ভুলে গেছেন"-এ ট্যাপ করুন। আপনার পাসওয়ার্ড নিরাপদে রিসেট করতে নির্দেশনাগুলো অনুসরণ করুন।

# faq3Question
source: 3. How can I book an appointment with a doctor?
ar: 3. كيف يمكنني حجز موعد مع الطبيب؟
bn: ৩. আমি কিভাবে একজন ডাক্তারের সাথে অ্যাপয়েন্টমেন্ট বুক করতে পারি?

# faq3Answer
source: Search for a doctor or specialty, select an available time slot, and confirm your appointment.
ar: ابحث عن طبيب أو تخصص، واعرف المواعيد المتاحة، ثم قم بتأكيد موعدك.
bn: একজন ডাক্তার বা বিশেষত্ব খুঁজুন, একটি খালি সময় স্লট নির্বাচন করুন এবং আপনার অ্যাপয়েন্টমেন্ট নিশ্চিত করুন।

# faq4Question
source: 4. Can I cancel or reschedule my appointment?
ar: 4. هل يمكنني إلغاء أو إعادة جدولة موعدي؟
bn: ৪. আমি কি আমার অ্যাপয়েন্টমেন্ট বাতিল বা পুনরায় শিডিউল করতে পারি?

# faq4Answer
source: Yes, you can cancel or reschedule appointments from the “My Appointments” section, depending on the appointment status.
ar: نعم، يمكنك إلغاء أو إعادة جدولة المواعيد من قسم "مواعيدي"، اعتماداً على حالة الموعد.
bn: হ্যাঁ, অ্যাপয়েন্টমেন্টের স্ট্যাটাস অনুযায়ী আপনি "আমার অ্যাপয়েন্টমেন্ট" বিভাগ থেকে অ্যাপয়েন্টমেন্ট বাতিল বা পুনরায় শিডিউল করতে পারেন।

# faq5Question
source: 5. How do online audio/video consultations work?
ar: 5. كيف تعمل الاستشارات الصوتية والمرئية عبر الإنترنت؟
bn: ৫. অনলাইন অডিও/ভিডিও পরামর্শ কিভাবে কাজ করে?

# faq5Answer
source: Once your appointment is confirmed, you can start an audio or video call directly from the chat at the scheduled time (if enabled by the doctor).
ar: بمجرد تأكيد موعدك، يمكنك بدء مكالمة صوتية أو مرئية مباشرة من الدردشة في الوقت المحدد (إذا تم تفعيلها من قبل الطبي).
bn: আপনার অ্যাপয়েন্টমেন্ট নিশ্চিত হয়ে গেলে নির্ধারিত সময়ে ভিডিও কল শুরু করতে পারবেন।

# faq6Question
source: 6. Why can’t I start a call with the doctor?
ar: 6. لماذا لا يمكنني بدء مكالمة مع الطبيب؟

# faq6Answer
source: The doctor may have disabled audio/video calls temporarily. Please try again later or contact support.
ar: قد يكون الطبيب قد قام بتعطيل المكالمات الصوتية/المرئية مؤقتاً. يرجى المحاولة مرة أخرى لاحقاً أو الاتصال بالدعم.

# faq7Question
source: 7. How do I change the app language?
ar: 7. كيف يمكنني تغيير لغة التطبيق؟
bn: ৭. আমি অ্যাপের ভাষা কিভাবে পরিবর্তন করব?

# faq7Answer
source: You can change the language from the app settings at any time.
ar: يمكنك تغيير اللغة من إعدادات التطبيق في أي وقت.
bn: আপনি যেকোনো সময় অ্যাপ সেটিংস থেকে ভাষা পরিবর্তন করতে পারেন।

# faq8Question
source: 8. How can doctors manage their profile information?
ar: 8. كيف يمكن للأطباء إدارة معلومات ملفهم الشخصي؟

# faq8Answer
source: Doctors can edit their personal and professional information from the profile settings.
ar: يمكن للأطباء تعديل معلوماتهم الشخصية والمهنية من إعدادات الملف الشخصي.

# faq9Question
source: 9. How does the referral system work?
ar: 9. كيف يعمل نظام الإحالة؟

# faq9Answer
source: If referral codes are enabled, doctors can register using a valid referral code provided by the admin.
ar: إذا تم تفعيل رموز الإحالة، يمكن للأطباء التسجيل باستخدام رمز إحالة صالح يقدمه المسؤول.

source: Still need help?
ar: هل مازلت بحاجة إلى مساعدة؟
bn: এখনো সাহায্যের প্রয়োজন?

source: Email Us
ar: راسلنا عبر البريد الإلكتروني
bn: আমাদের ইমেইল করুন

source: Call Us
ar: اتصل بنا
bn: আমাদের কল করুন

# emailSubject
source: Help & Support Request
ar: طلب المساعدة والدعم
bn: সাহায্য ও সহযোগিতার অনুরোধ

# bookingSuccess
source: Appointment booked successfully!
ar: تم حجز الموعد بنجاح!
bn: অ্যাপয়েন্টমেন্ট সফলভাবে বুক করা হয়েছে!

source: Bangla
bn: বাংলা
